# print('I will ba a Python developer')

# Выведите на экран результат произведения чисел 3 и 7
#
# Выведите на экран результат возведения числа 4 в степень 3
#
# Выведите на экран результат вычисления остатка от деления числа 29 на 5

# print(3 * 7)
#
# print(4 ** 3)
#
# print(29 % 5)

# Создайте переменные, описывающие автомобиль - модель, цвет, год, количество дверей.
# Поместите в них значения.
# Затем поменяйте цвет автомобиля, присвоив ниже в коде новое значение соответствующей переменной.
# Выведите на экран все значения.  При создании имён переменных используйте подходящие по смыслу слова.
# Воспользуйтесь Google переводчиком, если нужно.
#
# car_model = 'Mitsu'
# car_color = 'white'
# car_year = 2003
# car_num_of_doors = 5
#
# car_year = 2020
#
# print(car_model, car_color, car_year, car_num_of_doors)

# Создайте переменные, в которые будете помещать возраст людей.
# Также создайте переменную, в которой будет храниться количество людей.
# Вычислите и выведите на экран средний возраст человека исходя из данных о возрасте этих пятерых людей.
# Если не знаете формулу вычисления среднего арифметического значения, воспользуйтесь поиском информации в интернете.
# При создании имён переменных используйте подходящие по смыслу слова. Воспользуйтесь Google переводчиком, если нужно.

human1_age = 23
human2_age = 32
human3_age = 45
human4_age = 54
human_num = 4
mid_of_age = (human1_age + human2_age + human3_age + human4_age) / human_num

print(mid_of_age)
